{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["loss", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1", "config": {"strides": [2, 2], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "conv1", "filters": 64, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "relu_conv1", "config": {"trainable": false, "activation": "relu", "name": "relu_conv1"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "name": "pool1", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [3, 3], "trainable": false, "name": "pool1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "fire2/squeeze1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire2/squeeze1x1", "filters": 16, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "name": "fire2/relu_squeeze1x1", "config": {"trainable": false, "activation": "relu", "name": "fire2/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire2/expand1x1", "filters": 64, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand3x3", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire2/expand3x3", "filters": 64, "bias_constraint": null, "padding": "same", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "name": "fire2/relu_expand1x1", "config": {"trainable": false, "activation": "relu", "name": "fire2/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "name": "fire2/relu_expand3x3", "config": {"trainable": false, "activation": "relu", "name": "fire2/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "name": "fire2/concat", "config": {"trainable": false, "name": "fire2/concat", "axis": 3}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "name": "fire3/squeeze1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire3/squeeze1x1", "filters": 16, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "name": "fire3/relu_squeeze1x1", "config": {"trainable": false, "activation": "relu", "name": "fire3/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire3/expand1x1", "filters": 64, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand3x3", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire3/expand3x3", "filters": 64, "bias_constraint": null, "padding": "same", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "name": "fire3/relu_expand1x1", "config": {"trainable": false, "activation": "relu", "name": "fire3/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "name": "fire3/relu_expand3x3", "config": {"trainable": false, "activation": "relu", "name": "fire3/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]], "name": "fire3/concat", "config": {"trainable": false, "name": "fire3/concat", "axis": 3}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "name": "pool3", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [3, 3], "trainable": false, "name": "pool3", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool3", 0, 0, {}]]], "name": "fire4/squeeze1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire4/squeeze1x1", "filters": 32, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "name": "fire4/relu_squeeze1x1", "config": {"trainable": false, "activation": "relu", "name": "fire4/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire4/expand1x1", "filters": 128, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand3x3", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire4/expand3x3", "filters": 128, "bias_constraint": null, "padding": "same", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "name": "fire4/relu_expand1x1", "config": {"trainable": false, "activation": "relu", "name": "fire4/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "name": "fire4/relu_expand3x3", "config": {"trainable": false, "activation": "relu", "name": "fire4/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "name": "fire4/concat", "config": {"trainable": false, "name": "fire4/concat", "axis": 3}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "name": "fire5/squeeze1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire5/squeeze1x1", "filters": 32, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "name": "fire5/relu_squeeze1x1", "config": {"trainable": false, "activation": "relu", "name": "fire5/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire5/expand1x1", "filters": 128, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand3x3", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire5/expand3x3", "filters": 128, "bias_constraint": null, "padding": "same", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "name": "fire5/relu_expand1x1", "config": {"trainable": false, "activation": "relu", "name": "fire5/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "name": "fire5/relu_expand3x3", "config": {"trainable": false, "activation": "relu", "name": "fire5/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]], "name": "fire5/concat", "config": {"trainable": false, "name": "fire5/concat", "axis": 3}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "name": "pool5", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [3, 3], "trainable": false, "name": "pool5", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool5", 0, 0, {}]]], "name": "fire6/squeeze1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire6/squeeze1x1", "filters": 48, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "name": "fire6/relu_squeeze1x1", "config": {"trainable": false, "activation": "relu", "name": "fire6/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire6/expand1x1", "filters": 192, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand3x3", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire6/expand3x3", "filters": 192, "bias_constraint": null, "padding": "same", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "name": "fire6/relu_expand1x1", "config": {"trainable": false, "activation": "relu", "name": "fire6/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "name": "fire6/relu_expand3x3", "config": {"trainable": false, "activation": "relu", "name": "fire6/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "name": "fire6/concat", "config": {"trainable": false, "name": "fire6/concat", "axis": 3}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "name": "fire7/squeeze1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire7/squeeze1x1", "filters": 48, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]], "name": "fire7/relu_squeeze1x1", "config": {"trainable": false, "activation": "relu", "name": "fire7/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire7/expand1x1", "filters": 192, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand3x3", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire7/expand3x3", "filters": 192, "bias_constraint": null, "padding": "same", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]], "name": "fire7/relu_expand1x1", "config": {"trainable": false, "activation": "relu", "name": "fire7/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]], "name": "fire7/relu_expand3x3", "config": {"trainable": false, "activation": "relu", "name": "fire7/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]], "name": "fire7/concat", "config": {"trainable": false, "name": "fire7/concat", "axis": 3}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7/concat", 0, 0, {}]]], "name": "fire8/squeeze1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire8/squeeze1x1", "filters": 64, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]], "name": "fire8/relu_squeeze1x1", "config": {"trainable": false, "activation": "relu", "name": "fire8/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire8/expand1x1", "filters": 256, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand3x3", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire8/expand3x3", "filters": 256, "bias_constraint": null, "padding": "same", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]], "name": "fire8/relu_expand1x1", "config": {"trainable": false, "activation": "relu", "name": "fire8/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]], "name": "fire8/relu_expand3x3", "config": {"trainable": false, "activation": "relu", "name": "fire8/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]], "name": "fire8/concat", "config": {"trainable": false, "name": "fire8/concat", "axis": 3}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8/concat", 0, 0, {}]]], "name": "fire9/squeeze1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire9/squeeze1x1", "filters": 64, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]], "name": "fire9/relu_squeeze1x1", "config": {"trainable": false, "activation": "relu", "name": "fire9/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand1x1", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire9/expand1x1", "filters": 256, "bias_constraint": null, "padding": "valid", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand3x3", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "fire9/expand3x3", "filters": 256, "bias_constraint": null, "padding": "same", "trainable": false, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]], "name": "fire9/relu_expand1x1", "config": {"trainable": false, "activation": "relu", "name": "fire9/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]], "name": "fire9/relu_expand3x3", "config": {"trainable": false, "activation": "relu", "name": "fire9/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]], "name": "fire9/concat", "config": {"trainable": false, "name": "fire9/concat", "axis": 3}}, {"class_name": "Dropout", "inbound_nodes": [[["fire9/concat", 0, 0, {}]]], "name": "drop9", "config": {"trainable": true, "noise_shape": null, "seed": null, "name": "drop9", "rate": 0.5}}, {"class_name": "Conv2D", "inbound_nodes": [[["drop9", 0, 0, {}]]], "name": "conv10", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "name": "conv10", "filters": 1, "bias_constraint": null, "padding": "valid", "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["conv10", 0, 0, {}]]], "name": "tanh_conv10", "config": {"trainable": true, "activation": "tanh", "name": "tanh_conv10"}}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["tanh_conv10", 0, 0, {}]]], "name": "global_average_pooling2d_1", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "loss", "config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "loss", "activation": "tanh", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": false, "units": 1}}], "name": "model_1"}, "keras_version": "2.1.2"}